Messwerte/Archiv/Raw/apache_benchmark_repeat35/min/kata/go-httpd/target_count_2/repeat_10/2.txt
2020/01/21 04:26:07 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8002/
2020/01/21 04:26:37 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Completed 100000 requests
Completed 200000 requests
Completed 300000 requests
Completed 400000 requests
Finished 437998 requests
Server Software:        
Server Hostname:        192.168.3.100
Server Port:            8002
Document Path:          /
Document Length:        26 bytes
Concurrency Level:      100
Time taken for tests:   30.001 seconds
Complete requests:      437998
Failed requests:        0
Total transferred:      62636288 bytes
HTML transferred:       11388416 bytes
Requests per second:    14599.29 [#/sec] (mean)
Time per request:       6.850 [ms] (mean)
Time per request:       0.068 [ms] (mean, across all concurrent requests)
Transfer rate:          2038.85 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2  10.2      2    1037
Processing:     0    5   6.4      3     247
Waiting:        0    4   6.5      2     246
Total:          0    7  12.1      5    1047
Percentage of the requests served within a certain time (ms)
  50%      5
  66%      5
  75%      5
  80%      6
  90%     12
  95%     18
  98%     22
  99%     44
 100%   1047 (longest request)
2020/01/21 04:26:37 Matched stat line [Connect:        0    2  10.2      2    1037 Connect 0 2 10.2 2 1037]
2020/01/21 04:26:37 Matched stat line [Processing:     0    5   6.4      3     247 Processing 0 5 6.4 3 247]
2020/01/21 04:26:37 Matched stat line [Waiting:        0    4   6.5      2     246 Waiting 0 4 6.5 2 246]
2020/01/21 04:26:37 Matched stat line [Total:          0    7  12.1      5    1047 Total 0 7 12.1 5 1047]
2020/01/21 04:26:37 Matched percentline [  50%      5 50 5]
2020/01/21 04:26:37 Matched percentline [  66%      5 66 5]
2020/01/21 04:26:37 Matched percentline [  75%      5 75 5]
2020/01/21 04:26:37 Matched percentline [  80%      6 80 6]
2020/01/21 04:26:37 Matched percentline [  90%     12 90 12]
2020/01/21 04:26:37 Matched percentline [  95%     18 95 18]
2020/01/21 04:26:37 Matched percentline [  98%     22 98 22]
2020/01/21 04:26:37 Matched percentline [  99%     44 99 44]
2020/01/21 04:26:37 Matched percentline [ 100%   1047 100 1047]
{"connect":{"max":1037,"mean":2,"median":2,"min":0,"stdDev":10.199999809265137},"percentiles":{"100":1047,"50":5,"66":5,"75":5,"80":6,"90":12,"95":18,"98":22,"99":44},"processing":{"max":247,"mean":5,"median":3,"min":0,"stdDev":6.400000095367432},"total":{"max":1047,"mean":7,"median":5,"min":0,"stdDev":12.100000381469727},"waiting":{"max":246,"mean":4,"median":2,"min":0,"stdDev":6.5}}